## Staging: eks
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_alb.notification-canada-ca will be updated in-place
  ~ resource "aws_alb" "notification-canada-ca" {
        id                         = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:loadbalancer/app/notification-staging-alb/81d71deedddc8281"
        name                       = "notification-staging-alb"
        tags                       = {
            "CostCenter" = "notification-canada-ca-staging"
            "Name"       = "notification-canada-ca"
        }
        # (17 unchanged attributes hidden)

      ~ access_logs {
          ~ bucket  = "notification-canada-ca-staging-alb-logs" -> "cbs-satellite-239043911459"
          + prefix  = "lb_logs"
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose-waf-logs will be created
  + resource "aws_kinesis_firehose_delivery_stream" "firehose-waf-logs" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-notification-canada-ca-waf"
      + tags           = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-239043911459"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "GZIP"
          + prefix             = "waf_acl_logs/AWSLogs/239043911459/lb/"
          + role_arn           = "arn:aws:iam::239043911459:role/FirehoseWafLogs"
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_wafv2_web_acl_logging_configuration.firehose-waf-logs will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "firehose-waf-logs" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = "arn:aws:wafv2:ca-central-1:239043911459:regional/webacl/notification-canada-ca-waf/d7f2eabc-ee4e-4c8d-b262-97f5370b5555"

      + redacted_fields {

          + single_header {
              + name = "authorization"
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos-detected-load-balancer-critical"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
